<template>
    <NuxtLayout>
        <InfoHero
            class="franchise-hero"
            image-url="/img/temp/temp1.jpg"
            tag="Франшиза Arabeska"
            title="Благоухайте вместе с нами<span class='symbol'>!</span>🌸"
            desc="Полная упаковка и обучение бизнесу по франшизе от АРАБЕСКА"
        >
            <template #button>
                <a class="franchise-hero__button" href="#about">
                    <span>О франшизе</span>
                    <span><SvgSprite type="arrow" :size="24" /></span>
                </a>
            </template>
        </InfoHero>
        <div class="franchise">
            <FranchiseAbout />
            <FranchiseList />
            <AccordionSection
                title="Что включает обучение по нашей программе"
                description="Мы ценим каждого партнера и стремимся создать для Вас комфортные условия работы, чтобы помочь им достичь своих целей и обеспечить стабильный и прибыльный источник дохода."
                :content="faqList"
            />
            <FranchiseFeedback />
            <Banner
                class="franchise-banner"
                title="Начните работать с нами!"
                image-url="/img/temp/flowers.gif"
            >
                <div class="franchise-banner__content">
                    <p class="franchise-banner__text">
                        Наши официальные оптовики получают неоспоримые преимущества партнёрства:
                        доступ к многоуровневой партнёрской программе, скидки на продукцию, подарки
                        и многое другое
                    </p>
                    <button class="franchise-banner__button" type="button">
                        <span>Подать заявку</span>
                        <span><SvgSprite type="arrow" :size="24" /></span>
                    </button>
                </div>
            </Banner>
        </div>
    </NuxtLayout>
</template>

<script setup lang="ts">
    const faqList = [
        {
            title: 'Первый этап — консультации и планирование',
            content: `
                        <p>На этом этапе наши дизайнеры встретятся с вами, чтобы обсудить ваши предпочтения, цели и бюджет. Мы также проверим вашу недвижимость, чтобы понять ее потенциал и характеристики. На основе этой информации мы разработаем план действий для улучшения стиля и привлекательности вашего дома.</p>
                    `,
        },
        {
            title: 'Второй этап — дизайн и выбор площадок.',
            content: `
                        <p>На этом этапе наши дизайнеры встретятся с вами, чтобы обсудить ваши предпочтения, цели и бюджет. Мы также проверим вашу недвижимость, чтобы понять ее потенциал и характеристики. На основе этой информации мы разработаем план действий для улучшения стиля и привлекательности вашего дома.</p>
                    `,
        },
        {
            title: 'Третий этап — сопровождение разработки.',
            content: `
                        <p>На этом этапе наши дизайнеры встретятся с вами, чтобы обсудить ваши предпочтения, цели и бюджет. Мы также проверим вашу недвижимость, чтобы понять ее потенциал и характеристики. На основе этой информации мы разработаем план действий для улучшения стиля и привлекательности вашего дома.</p>
                    `,
        },
        {
            title: 'Последний этап — консультации и обучение долгосрочному планированию',
            content: `
                        <p>На этом этапе наши дизайнеры встретятся с вами, чтобы обсудить ваши предпочтения, цели и бюджет. Мы также проверим вашу недвижимость, чтобы понять ее потенциал и характеристики. На основе этой информации мы разработаем план действий для улучшения стиля и привлекательности вашего дома.</p>
                    `,
        },
    ];
</script>

<style scoped lang="scss">
    @use '~/assets/scss/abstracts' as *;

    .franchise {
        background-color: $c-main;
    }
    .franchise-hero {
        &__button {
            margin-top: rem(64);
            @include button-primary($anim-color: $c-accent, $gap: rem(16));
        }
    }
    .franchise-banner {
        &__content {
            display: flex;
            flex-direction: column;
            gap: rem(32);
        }
        &__text {
            text-wrap: balance;
            line-height: 1.3;
        }
        &__button {
            @include button-primary($anim-color: $c-accent, $gap: rem(16));
        }
    }
</style>
