<template>
    <Accordion class="product-spoilers">
        <AccordionPanel
            :value="idx"
            class="product-spoilers__item"
            v-for="(item, idx) in spoilers"
            :key="idx"
        >
            <AccordionHeader class="product-spoilers__item-title">{{ item.title }}</AccordionHeader>
            <AccordionContent>
                <div class="product-spoilers__item-content" v-html="item.content"></div>
            </AccordionContent>
        </AccordionPanel>
    </Accordion>
</template>

<script setup lang="ts">
    // mock-data
    const spoilers = [
        {
            title: 'Уход за цветами',
            content: `                    <p>
                        В случае отсутствия получателя по адресу доставки или его отказа от
                        получения букета, мы готовы доставить цветы по другому адресу. Данные
                        предложение касается только монобукетов. Если получатель не смог принять
                        букет по указанному адресу, мы вернём стоимость заказа за вычетом услуг
                        курьерской службы. Мы также можем оформить повторную доставку. Сборные
                        композиции можно будет доставить повторно в течение 24-х часов по новому
                        адресу в черте города с повторной оплатой доставки.
                    </p>
                    <ul>
                        <li>
                            С 9:00 - 21:00 доставим цветы по Самаре бесплатно при заказе от 1500 ₽;
                        </li>
                        <li>Если стоимость заказа менее 1500 ₽, то стоимость доставки 300 ₽.</li>
                    </ul>
                    <ol>
                        <li>Всегда делайте срез над сочленнением стебля;</li>
                        <li>Нож обязательно должен быть чистым;</li>
                        <li>Никогда не подрезайте стебли ножницами — это сминает сосуды.</li>
                    </ol>
                    <p>
                        Более подробную информацию по возможности и стоимости доставки уточняйте у
                        менеджера компании LINKO по телефону
                        <a href="">+7 (812) 200-50-76</a>
                    </p>`,
        },
        {
            title: 'Доставка',
            content: `                    <p>
                        В случае отсутствия получателя по адресу доставки или его отказа от
                        получения букета, мы готовы доставить цветы по другому адресу. Данные
                        предложение касается только монобукетов. Если получатель не смог принять
                        букет по указанному адресу, мы вернём стоимость заказа за вычетом услуг
                        курьерской службы. Мы также можем оформить повторную доставку. Сборные
                        композиции можно будет доставить повторно в течение 24-х часов по новому
                        адресу в черте города с повторной оплатой доставки.
                    </p>
                    <ul>
                        <li>
                            С 9:00 - 21:00 доставим цветы по Самаре бесплатно при заказе от 1500 ₽;
                        </li>
                        <li>Если стоимость заказа менее 1500 ₽, то стоимость доставки 300 ₽.</li>
                    </ul>
                    <ol>
                        <li>Всегда делайте срез над сочленнением стебля;</li>
                        <li>Нож обязательно должен быть чистым;</li>
                        <li>Никогда не подрезайте стебли ножницами — это сминает сосуды.</li>
                    </ol>
                    <p>
                        Более подробную информацию по возможности и стоимости доставки уточняйте у
                        менеджера компании LINKO по телефону
                        <a href="">+7 (812) 200-50-76</a>
                    </p>`,
        },
        {
            title: 'Оплата',
            content: `                    <p>
                        В случае отсутствия получателя по адресу доставки или его отказа от
                        получения букета, мы готовы доставить цветы по другому адресу. Данные
                        предложение касается только монобукетов. Если получатель не смог принять
                        букет по указанному адресу, мы вернём стоимость заказа за вычетом услуг
                        курьерской службы. Мы также можем оформить повторную доставку. Сборные
                        композиции можно будет доставить повторно в течение 24-х часов по новому
                        адресу в черте города с повторной оплатой доставки.
                    </p>
                    <ul>
                        <li>
                            С 9:00 - 21:00 доставим цветы по Самаре бесплатно при заказе от 1500 ₽;
                        </li>
                        <li>Если стоимость заказа менее 1500 ₽, то стоимость доставки 300 ₽.</li>
                    </ul>
                    <ol>
                        <li>Всегда делайте срез над сочленнением стебля;</li>
                        <li>Нож обязательно должен быть чистым;</li>
                        <li>Никогда не подрезайте стебли ножницами — это сминает сосуды.</li>
                    </ol>
                    <p>
                        Более подробную информацию по возможности и стоимости доставки уточняйте у
                        менеджера компании LINKO по телефону
                        <a href="">+7 (812) 200-50-76</a>
                    </p>`,
        },
        {
            title: 'Правила возврата',
            content: `                    <p>
                        В случае отсутствия получателя по адресу доставки или его отказа от
                        получения букета, мы готовы доставить цветы по другому адресу. Данные
                        предложение касается только монобукетов. Если получатель не смог принять
                        букет по указанному адресу, мы вернём стоимость заказа за вычетом услуг
                        курьерской службы. Мы также можем оформить повторную доставку. Сборные
                        композиции можно будет доставить повторно в течение 24-х часов по новому
                        адресу в черте города с повторной оплатой доставки.
                    </p>
                    <ul>
                        <li>
                            С 9:00 - 21:00 доставим цветы по Самаре бесплатно при заказе от 1500 ₽;
                        </li>
                        <li>Если стоимость заказа менее 1500 ₽, то стоимость доставки 300 ₽.</li>
                    </ul>
                    <ol>
                        <li>Всегда делайте срез над сочленнением стебля;</li>
                        <li>Нож обязательно должен быть чистым;</li>
                        <li>Никогда не подрезайте стебли ножницами — это сминает сосуды.</li>
                    </ol>
                    <p>
                        Более подробную информацию по возможности и стоимости доставки уточняйте у
                        менеджера компании LINKO по телефону
                        <a href="">+7 (812) 200-50-76</a>
                    </p>`,
        },
    ];
</script>

<style lang="scss">
    @use '~/assets/scss/abstracts' as *;

    .product-spoilers {
        $p: &;

        display: flex;
        flex-direction: column;
        gap: rem(16);
        border-style: hidden;
        * {
            border-style: hidden !important;
        }
        &__item {
            display: flex;
            flex-direction: column;
            font-family: 'Inter', sans-serif;
            border: rem(1) solid $c-D4E1E7 !important;
            border-radius: rem(40);
            &-title {
                font-size: lineScale(32, 24, 480, 1440) !important;
                font-weight: $fw-semi !important;
                padding: lineScale(40, 24, 480, 1440) !important;
            }
            &-content {
                display: flex;
                flex-direction: column;
                gap: rem(24);
                line-height: 1.4;
                padding: lineScale(40, 24, 480, 1440);
                padding-top: 0;
                ul,
                ol {
                    display: flex;
                    flex-direction: column;
                    gap: rem(8);
                    > li {
                        margin-left: rem(18);
                    }
                }
                ul > li {
                    list-style: disc outside;
                }
                ol > li {
                    list-style: decimal outside;
                }
                a {
                    color: $c-accent;
                    text-decoration: underline;
                    @media (pointer: fine) {
                        &:hover {
                            text-decoration: none;
                        }
                    }
                }
            }
        }
    }
</style>
